In [48]:
import pandas as pd

In [49]:
d = {'py101':[10,5,33,45,25,22],
    'py111':[0,15,21,30,31,111],
    'py121':[15,5,1,10,42,21],
    'py301':[20,35,3,15,0,0],}

In [50]:
df = pd.DataFrame(data=d)
df

   py101  py111  py121  py301
0     10      0     15     20
1      5     15      5     35
2     33     21      1      3
3     45     30     10     15
4     25     31     42      0
5     22    111     21      0

In [51]:
meses = ['ene', 'feb', 'mar', 'abr']
items = ('mesas', 'sillas', 'escritorios', 'bancos', 'sillones', 'puertas')
df = pd.DataFrame(data=d, index=items)
df

             py101  py111  py121  py301
mesas           10      0     15     20
sillas           5     15      5     35
escritorios     33     21      1      3
bancos          45     30     10     15
sillones        25     31     42      0
puertas         22    111     21      0

In [52]:
df.columns

Index(['py101', 'py111', 'py121', 'py301'], dtype='object')

In [53]:
df.columns = meses
df

             ene  feb  mar  abr
mesas         10    0   15   20
sillas         5   15    5   35
escritorios   33   21    1    3
bancos        45   30   10   15
sillones      25   31   42    0
puertas       22  111   21    0

In [54]:
df.index

Index(['mesas', 'sillas', 'escritorios', 'bancos', 'sillones', 'puertas'], dtype='object')

In [55]:
#df['mar']
df[['feb','mar','abr']]

             feb  mar  abr
mesas          0   15   20
sillas        15    5   35
escritorios   21    1    3
bancos        30   10   15
sillones      31   42    0
puertas      111   21    0

In [56]:
df['sillas':'bancos']

             ene  feb  mar  abr
sillas         5   15    5   35
escritorios   33   21    1    3
bancos        45   30   10   15

In [57]:
df[['feb','mar','abr']]['sillas':'bancos']

             feb  mar  abr
sillas        15    5   35
escritorios   21    1    3
bancos        30   10   15

In [58]:
df.info

<bound method DataFrame.info of              ene  feb  mar  abr
mesas         10    0   15   20
sillas         5   15    5   35
escritorios   33   21    1    3
bancos        45   30   10   15
sillones      25   31   42    0
puertas       22  111   21    0>

In [59]:
df.describe()

             ene         feb        mar        abr
count   6.000000    6.000000   6.000000   6.000000
mean   23.333333   34.666667  15.666667  12.166667
std    14.706008   39.082818  14.719601  13.934370
min     5.000000    0.000000   1.000000   0.000000
25%    13.000000   16.500000   6.250000   0.750000
50%    23.500000   25.500000  12.500000   9.000000
75%    31.000000   30.750000  19.500000  18.750000
max    45.000000  111.000000  42.000000  35.000000

In [60]:
df['feb'].describe()

count      6.000000
mean      34.666667
std       39.082818
min        0.000000
25%       16.500000
50%       25.500000
75%       30.750000
max      111.000000
Name: feb, dtype: float64

In [61]:
print("Promedio Feb ",df['feb'].mean())
print("Max Feb ", df['feb'].max())

Promedio Feb  34.666666666666664
Max Feb  111

In [62]:
df['feb']

mesas            0
sillas          15
escritorios     21
bancos          30
sillones        31
puertas        111
Name: feb, dtype: int64

In [63]:
df['feb_iva'] = df['feb'] * 1.16
df
#df['feb'] * 1.16

             ene  feb  mar  abr  feb_iva
mesas         10    0   15   20     0.00
sillas         5   15    5   35    17.40
escritorios   33   21    1    3    24.36
bancos        45   30   10   15    34.80
sillones      25   31   42    0    35.96
puertas       22  111   21    0   128.76

In [64]:
df['feb']['escritorios']

21

In [59]:
! pwd

/content

In [ ]:
! ls -la datos

total 12
drwxr-xr-x 2 root root 4096 Oct 26 14:25 .
drwxr-xr-x 1 root root 4096 Oct 26 14:25 ..
-rw-r--r-- 1 root root  182 Oct 26 14:25 clientes.csv

In [ ]:
! cat datos/clientes.csv

ident,nombre,primer_apellido,suc_origen
19232,Adriana,Sánchez,CDMX01
19233,Marcos,García,CDMX02
19234,Rubén,Rincón,CDMX02
19235,Samuel,Oliva,CDMX01
19236,Martha,Martínez,CDMX03

In [65]:
#Leer csv
df_clientes = pd.read_csv('datos/clientes.csv')
df_clientes

   ident   nombre primer_apellido suc_origen
0  19232  Adriana         Sánchez     CDMX01
1  19233   Marcos          García     CDMX02
2  19234    Rubén          Rincón     CDMX02
3  19235   Samuel           Oliva     CDMX01
4  19236   Martha        Martínez     CDMX03

In [66]:
df_clientes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ident            5 non-null      int64
 1   nombre           5 non-null      object
 2   primer_apellido  5 non-null      object
 3   suc_origen       5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes

In [67]:
df_clientes.describe()

              ident
count      5.000000
mean   19234.000000
std        1.581139
min    19232.000000
25%    19233.000000
50%    19234.000000
75%    19235.000000
max    19236.000000

In [ ]:
! cat datos/facturas.csv

folio|sucursal|monto|fecha|cliente
15234|CDMX01|1420.0|2019-03-11 17:24:00|19234
15235|MTY01|1532.0|2019-03-24 14:46:00|19232
15236|CDMX02|890.0|2019-03-25 17:58:00|19235
15237|CDMX02|1300.0|2019-03-27 13:11:00|19233
15238|MTY01|3121.47|2019-03-31 10:25:00|19236
15239|GDL01|1100.5|2019-04-01 18:32:00|19237
15240|CDMX02|12230.0|2019-04-03 11:43:00|19232
15241|MTY01|230.85|2019-04-04 16:55:00|19233
15242|GDL01|1569.0|2019-04-05 12:59:00|19232
15243|GDL01|2569.0|2019-05-05 12:59:00|19232

In [68]:
#Leer csv
df_fact = pd.read_csv('datos/facturas.csv', sep='|')
df_fact

   folio sucursal     monto                fecha  cliente
0  15234   CDMX01   1420.00  2019-03-11 17:24:00    19234
1  15235    MTY01   1532.00  2019-03-24 14:46:00    19232
2  15236   CDMX02    890.00  2019-03-25 17:58:00    19235
3  15237   CDMX02   1300.00  2019-03-27 13:11:00    19233
4  15238    MTY01   3121.47  2019-03-31 10:25:00    19236
5  15239    GDL01   1100.50  2019-04-01 18:32:00    19237
6  15240   CDMX02  12230.00  2019-04-03 11:43:00    19232
7  15241    MTY01    230.85  2019-04-04 16:55:00    19233
8  15242    GDL01   1569.00  2019-04-05 12:59:00    19232
9  15243    GDL01   2569.00  2019-05-05 12:59:00    19232

In [69]:
df_fact.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   folio     10 non-null     int64
 1   sucursal  10 non-null     object
 2   monto     10 non-null     float64
 3   fecha     10 non-null     object
 4   cliente   10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 528.0+ bytes

In [70]:
df_equipos = pd.read_csv('https://raw.githubusercontent.com/omarmendoza564/datos/main/datos/equipos.csv')
df_equipos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       30 non-null     int64
 1   equipos  30 non-null     object
 2   bateos   30 non-null     int64
 3   runs     30 non-null     int64
dtypes: int64(3), object(1)
memory usage: 1.1+ KB

In [71]:
df_equipos

    id       equipos  bateos  runs
0    0         Texas    5659   855
1    1        Boston    5710   875
2    2       Detroit    5563   787
3    3        Kansas    5672   730
4    4           St.    5532   762
5    5        New_S.    5600   718
6    6        New_Y.    5518   867
7    7     Milwaukee    5447   721
8    8      Colorado    5544   735
9    9       Houston    5598   615
10  10     Baltimore    5585   708
11  11       Los_An.    5436   644
12  12       Chicago    5549   654
13  13    Cincinnati    5612   735
14  14        Los_P.    5513   667
15  15  Philadelphia    5579   713
16  16       Chicago    5502   654
17  17     Cleveland    5509   704
18  18       Arizona    5421   731
19  19       Toronto    5559   743
20  20     Minnesota    5487   619
21  21       Florida    5508   625
22  22    Pittsburgh    5421   610
23  23       Oakland    5452   645
24  24         Tampa    5436   707
25  25       Atlanta    5528   641
26  26    Washington    5441   624
27  27         San.F    5486   570
28  28         San.I    5417   593
29  29       Seattle    5421   556

In [72]:
df_iris = pd.read_json('datos/iris.json')
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   sepalLength  150 non-null    float64
 1   sepalWidth   150 non-null    float64
 2   petalLength  150 non-null    float64
 3   petalWidth   150 non-null    float64
 4   species      150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [73]:
df_iris

     sepalLength  sepalWidth  petalLength  petalWidth    species
0            5.1         3.5          1.4         0.2     setosa
1            4.9         3.0          1.4         0.2     setosa
2            4.7         3.2          1.3         0.2     setosa
3            4.6         3.1          1.5         0.2     setosa
4            5.0         3.6          1.4         0.2     setosa
..           ...         ...          ...         ...        ...
145          6.7         3.0          5.2         2.3  virginica
146          6.3         2.5          5.0         1.9  virginica
147          6.5         3.0          5.2         2.0  virginica
148          6.2         3.4          5.4         2.3  virginica
149          5.9         3.0          5.1         1.8  virginica

[150 rows x 5 columns]